update planning
